{
  "Entries": [
    {
      "RequestUri": "/subscriptions/075423e9-7d33-4166-8bdf-3920b04e3735/resourceGroups/MichalResourceGroup/providers/Microsoft.Security/iotSecuritySolutions/MichalDemoHub/analyticsModels/default/aggregatedAlerts/IoT_CryptoMiner%2F2020-03-15?api-version=2019-08-01",
      "EncodedRequestUri": "L3N1YnNjcmlwdGlvbnMvMDc1NDIzZTktN2QzMy00MTY2LThiZGYtMzkyMGIwNGUzNzM1L3Jlc291cmNlR3JvdXBzL01pY2hhbFJlc291cmNlR3JvdXAvcHJvdmlkZXJzL01pY3Jvc29mdC5TZWN1cml0eS9pb3RTZWN1cml0eVNvbHV0aW9ucy9NaWNoYWxEZW1vSHViL2FuYWx5dGljc01vZGVscy9kZWZhdWx0L2FnZ3JlZ2F0ZWRBbGVydHMvSW9UX0NyeXB0b01pbmVyJTJGMjAyMC0wMy0xNT9hcGktdmVyc2lvbj0yMDE5LTA4LTAx",
      "RequestMethod": "GET",
      "RequestBody": "",
      "RequestHeaders": {
        "x-ms-client-request-id": [
          "0ba96391-a05a-48ca-b271-2af1c0e22b97"
        ],
        "Accept-Language": [
          "en-US"
        ],
        "User-Agent": [
          "FxVersion/4.6.28207.03",
          "OSName/Windows",
          "OSVersion/Microsoft.Windows.10.0.18363.",
          "Microsoft.Azure.Management.Security.SecurityCenterClient/1.1.1.0"
        ]
      },
      "ResponseHeaders": {
        "Cache-Control": [
          "no-cache"
        ],
        "Pragma": [
          "no-cache"
        ],
        "x-ms-ratelimit-remaining-subscription-reads": [
          "11968"
        ],
        "Server": [
          "Kestrel"
        ],
        "x-ms-request-id": [
          "9f9a665a-2ad7-4cc8-bba1-032b2361045d"
        ],
        "x-ms-correlation-request-id": [
          "9f9a665a-2ad7-4cc8-bba1-032b2361045d"
        ],
        "x-ms-routing-request-id": [
          "WESTEUROPE:20200315T184518Z:9f9a665a-2ad7-4cc8-bba1-032b2361045d"
        ],
        "Strict-Transport-Security": [
          "max-age=31536000; includeSubDomains"
        ],
        "X-Content-Type-Options": [
          "nosniff"
        ],
        "Date": [
          "Sun, 15 Mar 2020 18:45:18 GMT"
        ],
        "Content-Length": [
          "1560"
        ],
        "Content-Type": [
          "application/json; charset=utf-8"
        ],
        "Expires": [
          "-1"
        ]
      },
      "ResponseBody": "{\r\n  \"id\": \"/subscriptions/075423e9-7d33-4166-8bdf-3920b04e3735/resourceGroups/michalresourcegroup/providers/Microsoft.Security/IoTSecuritySolutions/Locations/westus/default/IoT_CryptoMiner/2020-03-15\",\r\n  \"name\": \"/subscriptions/075423e9-7d33-4166-8bdf-3920b04e3735/resourceGroups/michalresourcegroup/providers/Microsoft.Security/IoTSecuritySolutions/Locations/westus/default/IoT_CryptoMiner/2020-03-15\",\r\n  \"type\": \"Microsoft.Security/IoTSecurityAggregatedAlert\",\r\n  \"properties\": {\r\n    \"alertType\": \"IoT_CryptoMiner\",\r\n    \"alertDisplayName\": \"Crypto coin miner image\",\r\n    \"aggregatedDateUtc\": \"2020-03-15\",\r\n    \"vendorName\": \"Microsoft\",\r\n    \"count\": 2,\r\n    \"effectedResourceType\": \"IoT Device\",\r\n    \"systemSource\": \"Devices\",\r\n    \"actionTaken\": \"Detected\",\r\n    \"remediationSteps\": \"Verify with the user that ran the command this was legitimate activity on the device. If not, escalate the alert to the information security team.\",\r\n    \"topDevicesList\": null,\r\n    \"reportedSeverity\": \"High\",\r\n    \"description\": \"Execution of a process normally associated with digital currency mining detected.\",\r\n    \"logAnalyticsQuery\": \"SecurityAlert | where tolower(ResourceId) == tolower('/subscriptions/075423e9-7d33-4166-8bdf-3920b04e3735/resourcegroups/michalresourcegroup/providers/microsoft.devices/iothubs/michaldemohub') and tolower(AlertName) == tolower('Crypto coin miner image') and TimeGenerated > datetime(2020-03-15T00:00:00Z) and TimeGenerated < datetime(2020-03-16T00:00:00Z) | extend DeviceId=parse_json(ExtendedProperties)['DeviceId'] | project DeviceId, TimeGenerated, DisplayName, AlertSeverity, Description, RemediationSteps, ExtendedProperties\"\r\n  }\r\n}",
      "StatusCode": 200
    }
  ],
  "Names": {},
  "Variables": {
    "SubscriptionId": "075423e9-7d33-4166-8bdf-3920b04e3735"
  }
}